//Приклад программи яка здійснює діалог з користувачем, та отримує відповіді на три запитання, які мають бути відповіддю "так" або "ні"
//оголошення змінних
let answer1, answer2, answer3;

// propt() - створює діалогове вікно в браузері з запитанням та варіантами відповідей
//користувач може ввести один з варіантів відповіді: "так" або "ні"
//відповіді записуються в змінні answer1, answer2, answer3
answer1 = prompt("Чи вам програмування на JS", "так/ні");
answer2 = prompt("Чи знаєте ви що таке змінні та як їх використовувати?", "так/ні");
answer3 = prompt("Чи бажаєте ви дізнатися більше про JS?", "так/ні");
// значення записані в змінні виводяться в консоль за допомогою console.log()
console.log("Ваші відповіді:");
console.log("1. " + answer1);
console.log("2. " + ansпоwer2);
console.log("3. " + answer3);